#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYzA5N2FkYS0yOTQyLTQwMjItYTEzNy1lN2JhYmQ3N2I4Yzc7b2JqZWN0SWQ9ZjgxYjViOTYtZjEwZS00NjdkLWJhMGMtNDE5NmZkMWEzMWY4O3N1YnNjcmlwdGlvbklkPWU4MmM1MjY3LTlkYzQtNGY0NS1hYzEzLWFiZGQ1ZTEzMGQyNzt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ghr-prd-uai001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001][0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ContainerAppSubnet][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/CAPrivateEndpointSubnet][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001/providers/Microsoft.Authorization/roleAssignments/eb40e442-e76a-3d67-fac5-46e5e5a594bf][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001/providers/Microsoft.Authorization/roleAssignments/f22f336e-4b23-40e0-24cc-5a2f87fa8451][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Network/privateEndpoints/ghr-prd-kv001-pe][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_github_pat: Refreshing state... [id=https://ghr-prd-kv001.vault.azure.net/secrets/github-pat/971b346864ba4f979f1f9b9d1afd511b][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazapi_resource.container_apps_environment: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/managedEnvironments/ghr-prd-cae001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001|logAnalytics][0m
[0m[1mazapi_resource.container_apps_job: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/jobs/ghr-prd-caj001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azapi_resource.container_apps_job[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "container_apps_job" {
      [33m~[0m[0m body                      = (sensitive value)
        id                        = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/jobs/ghr-prd-caj001"
        name                      = "ghr-prd-caj001"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {
            "workload" = "github-runners"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_github_pat[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_github_pat" {
        id                      = "https://ghr-prd-kv001.vault.azure.net/secrets/github-pat/971b346864ba4f979f1f9b9d1afd511b"
        name                    = "github-pat"
        tags                    = {}
      [33m~[0m[0m value                   = (sensitive value)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault_secrets_officer[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault_secrets_officer" {
      [33m~[0m[0m id                                     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001/providers/Microsoft.Authorization/roleAssignments/eb40e442-e76a-3d67-fac5-46e5e5a594bf" -> (known after apply)
      [33m~[0m[0m name                                   = "eb40e442-e76a-3d67-fac5-46e5e5a594bf" -> (known after apply)
      [33m~[0m[0m principal_id                           = "aee6a895-4b96-4add-bdd0-0af5c21a048d" [33m->[0m[0m "f81b5b96-f10e-467d-ba0c-4196fd1a31f8" [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                         = "User" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 2 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>